myQuote/app/views/home/aindex.html.erb

<%= "There are currently:" %>
<%= " - #{User.all.count} users." %>
<%= " - #{Quote.all.count} quotes." %>
<%= " - #{Source.all.count} sources." %>
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "quotes"
SELECT COUNT(*) FROM "sources"