myQuote/app/views/home/uindex.html.erb

SELECT COUNT(*) FROM "quotes" WHERE "quotes"."user_id" = ?  [["user_id", 32]]
---
<div>
<%= "You currently have #{Quote.where(user_id: session[:user_id]).count} quotes." %>