myQuote/app/views/search/index.html.erb

<!-- this line just lists the available categories to search -->
<div style="font-size:12px;"><% categ = Category.order(catname: :asc).all %><% categ.each do |category| %> - <%=category.catname%><% end %> - </div>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."catname" ASC