myQuote/app/views/sources/show.html.erb

<div>
<% sourcequotes = Quote.where(source_id: @source.id)  %>
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."source_id" = ?  [["source_id", 12]]