myQuote/app/controllers/home_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."ispublic" = ? ORDER BY "quotes"."id" DESC LIMIT ?  [["ispublic", 1], ["LIMIT", 5]]
SELECT "sources".* FROM "sources" WHERE "sources"."id" IN (?, ?, ?, ?)  [["id", 1], ["id", 2], ["id", 3], ["id", 4]]
---
  def index
    @quotes = Quote.includes(:source).reverse_order.where(ispublic: true ).take(5)

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ?  [["user_id", 13]]
SELECT "sources".* FROM "sources" WHERE "sources"."id" IN (?, ?, ?, ?)  [["id", 3], ["id", 4], ["id", 1], ["id", 2]]
---
  def uquotes
    @quotes = Quote.includes(:source, :categories).where(user_id: session[:user_id])