myQuote/app/controllers/home_controller.rb

  def index
    @quotes = Quote.includes(:source).take(5)
---
SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."id" DESC LIMIT ?  [["LIMIT", 5]]