myQuote/app/controllers/quotes_controller.rb

INSERT INTO "quotes" ("qtext", "qyear", "qcom", "ispublic", "user_id", "source_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @quote = Quote.new(quote_params)

    respond_to do |format|
      if @quote.save

UPDATE "quotes" SET "source_id" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["source_id", 22], ["updated_at", "2023-10-18 06:11:45.772478"], ["id", 39]]
---
  def update
    respond_to do |format|
      if @quote.update(quote_params)