myQuote/app/controllers/search_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."ispublic" = ?  [["ispublic", 1]]
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "quote_categories" "quote_categories_quotes_join" ON "quote_categories_quotes_join"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories_quotes_join"."category_id" WHERE (categories.catname LIKE '%sad%')
---
  def index
    category_query = params[:category_query]
    if category_query.present? && Quote.where(ispublic: true)
      @quotematch = Quote.joins(:quote_categories, :categories).where("categories.catname LIKE ?", "%#{category_query}%").distinct