myQuote/app/controllers/users_controller.rb

INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "fname" = ?, "lname" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["fname", "Lou"], ["lname", "Skunt"], ["password_digest", "[FILTERED]"], ["updated_at", "2023-10-17 00:32:41.722761"], ["id", 17]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)