myQuote/app/views/quotes/_form.html.erb

SELECT "sources".* FROM "sources"
---
     <p>
     <%= f.collection_select :source_id, Source.all, :id, Proc.new { |sou| "#{sou.fname} #{sou.lname}" },{ :prompt => "Select source" }, class: 'form-select' %>

SELECT "categories".* FROM "categories"
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 16]]
---
    <div id="categories-container">
      <% @quote.quote_categories.each do |quote_category| %>

SELECT "categories".* FROM "categories"
---
    <%= qc.label :category_id, "Category", class: "form-label d-inline-block me-2" %>
    <%= qc.select :category_id, Category.all.collect { |cat| [cat.catname, cat.id] }, { :prompt => "Select Category" }, class: "form-control d-inline-block" %>